# YOLOv12 自定义配置（核心改进：区域注意力A²模块[7](@ref)）
nc: 1 # 类别数（根据实际修改）
scales: 
  s: [0.50, 0.50, 1024]  # 小规模模型（可选n/s/m/l/x）

backbone:
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 2, C3k2, [256]]        # 区域注意力模块A²[6](@ref)
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512]] 
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 4, A2C2f, [512]]       # 改进型特征融合模块[7](@ref)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]   # 多尺度特征融合
  - [-1, 2, A2C2f, [512]]       # 头部区域注意力
  - [-1, 1, nn.Conv2d, [nc, 1, 1]]  # 检测头